In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [7]:
len(df['col2'].unique()) #or #df['col2'].nunique() # returns the number of unique values

3

In [8]:
df['col2'].value_counts() # returns how many times a number in the column occurs

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [11]:
df[df['col1']>2] # returns the columns of df where the condition is satisfied

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [13]:
df['col1']>2 # returns bool values of df

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [15]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [17]:
def times2(x):
    return x*2

In [18]:
df['col1'].sum()

10

In [19]:
df['col1'].apply(times2) # returns all values of the column1 times 2 as we passed our function in it

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [21]:
df['col3'].apply(len) # returns length of all values of col3

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [23]:
df['col2'].apply(lambda x: x*2) # saari values ko times 2 kar diya without having to create a user defined function

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [24]:
df.drop('col1', axis=1) # drops column 1

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [27]:
df.sort_values('col2') # returns a sorted df but its index never changes

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [29]:
df.isnull() # returns bool values in df if any of the values is null

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [33]:
data = ({'A':['foo','foo','foo','bar','bar','bar'],
         'B':['one','one','two','two','one','one'],
         'C':['x','y','x','y','x','y'],
         'D':[1,3,2,5,4,1]})

df1 = pd.DataFrame(data)
df1

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [42]:
df1.pivot_table(values='D',index=['A','B'], columns=['C']).fillna('hi')
# we are taking vals of col D, Index A aur B ko banaya, isliye foo and bar ek segment hue, unke sub segments B se one and two hue
# aur column C ke X and Y mei new columns generate hue

C          x    y
A   B
bar one  4.0  1.0
    two   hi  5.0
foo one  1.0  3.0
    two  2.0   hi

In [44]:
df1.pivot_table(values='D',index=['B','A'], columns=['C']).fillna('hi')

C          x    y
B   A
one bar  4.0  1.0
    foo  1.0  3.0
two bar   hi  5.0
    foo  2.0   hi